{"jobs":[{"title":"React-js Developer","company":"Wappgo","location":"Indore, Madhya Pradesh","description":"Job Description\n\nAs a React.js developer, you will implement new features and maintain existing code using React and other standard tools in the React ecosystem, such as Node.js and Yarn. Your duties will include designing software solutions to meet project requirements, maintaining and refactoring existing code, writing tests, and fixing bugs.\n\nResponsibilities\n• Have good knowledge or experience on Axios and fetch\n• Have good knowledge of React Native.\n• Design and develop new custom components to meet project requirements\n• Install and configure server environments for React deployments\n• Maintain and update project dependencies as well as fix any conflicts\n• Working with other JavaScript developers and software engineers to develop front-end\n• and back-end architecture that’s well structured and flexible, along with the APIs to support it.\n\nSkills\n• Strong proficiency in JavaScript, object model, DOM manipulation and event handlers, data structures, algorithms, JSX, and Babel\n•... Complete understanding of ReactJS and its main fundamentals like JSX, Virtual DOM, component lifecycle, etc.\n• Preceding experience with ReactJS workflows like Flux, Redux, Create React App, data structure libraries\n• Understanding of RESTful APIs/GraphQL, HTML/CSS, ES6 (variables and scoping, array methods), code versioning tools like GIT, SVN, etc., popular frontend development tools, CI/CD tools, DevOps, performance testing frameworks like Mocha, Node + NPM\n• Preferred degree in Computer Science, Information Technology or similar\n\nSalary\n\nNo bar for talant ₹ 1.8LPA-3LPA"},{"title":"React.js Developer","company":"PythonMate","location":"via LinkedIn","description":"Hiteshi , is an offshore development firm catering up the clientele spread across 21 countries and covering majorly USA, Europe, Middle East and East Asia. We deal in mobile and web application development and has a rich experience of 15+ years. The company has an expert team of experienced professionals on the technologies like IOS, Android, PHP, Asp.net etc.\n\nThe Role\n\nJob Description\n\nPosition: Reactjs Developer\n\nRequired Experience: 2+ Years\n\nLocation: Indore\n\nPosition Summary\n\nWe are looking for an experienced front-end developer to join our fast growing team who thinks outside the box and can push the limits. We're looking for someone who cares about the quality of code and who is passionate about providing the best solution to meet the client's needs. Someone who has the ability to solve problems in coding, testing, and deployment.\n\nYou will be a key contributor to our delivery team and if you think you fit right in to help our clients navigate their next digital transformation... journey, this is the place for you!\n\nRoles & Responsibilities\n• Writing and implementing efficient code on time maintaining the quality standards/Write well designed, efficient, reusable, and reliable code\n• Work on Coding, bug fixing, and improving application performance\n• Work with outside data sources and APIs\n• Continuously discover, evaluate, and implement new technologies to maximize development efficiency\n• Design, build, and maintain high performance, reusable, and reliable code\n• Ensure the best possible performance, quality, and responsiveness of the application\n• Identify and correct bottlenecks and fix bugs\n• Be enthusiastic and active in learning & developing new technologies and frameworks and updation of technical Skills\n• Developing new user-facing features using React.js\n• Building reusable components and front-end libraries for future use\n\nIdeal Profile\n\nDesired Skill Set\n• Strong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\n• Thorough understanding of React.js and its core principles\n• Experience with popular React.js workflows (such as Flux or Redux)\n• Familiarity with newer specifications of EcmaScript\n• Experience with data structure libraries (e.g., Immutable.js)\n• Knowledge of isomorphic React is a plus\n• Familiarity with RESTful APIs & HTML / CSS\n• GIT experience is a plus\n• Knowledge of modern authorization mechanisms, such as JSON Web Token\n• Familiarity with modern front-end build pipelines and tools\n• Experience with common front-end development tools such as Babel, Webpack, NPM, etc.\n• Familiarity with code versioning tools such as Git, SVN, and Mercurial\n• Analytical abilities & Logical thinking\n• Awareness of latest technologies and trends\n• Good verbal and written communication skills\n\nYour Life @Hiteshi\n\nWhat matters to you when you're looking for your next career challenge?\n\nWhat about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust - where everyone has a voice? What about all of these? If so, then Hiteshi should be your next career goal. Join us, not to do something better, but to do your best work ever!\n\nBenefits\n\nAt Hiteshi we offer a range of benefits allowing every colleague to choose the best options for their professional & personal growth. These include a Transparent work environment, Work-Life Balance, Great Learning Opportunities, Health Care and all the tools, technology and support to help you become the very best you can be.\n\nOther Benefits\n• Medical Insurance\n• Attractive Incentives and Bonus on top of CTC\n• 5 days relax working\n• Top-notch office Infrastructure/ Modern Office Facilities\n• Maternity Leaves\n• Overseas client site opportunities\n• Sponsored Employee Training Programs\n• Work from Home\n• Team building and fun activities\n• Experienced professional team\n• Dynamic and friendly work environment\n• Open and transparent communication\n• Long term career growth opportunities\n• Healthy snacks always available at the office and much more.\n\nWhat's on Offer?\n• Join a well known brand within IT Software\n• Attractive salary & benefits\n• Excellent career development opportunities"},{"title":"React Js Developer","company":"Hiteshi Infotech Pvt. Ltd.","location":"Indore, Madhya Pradesh","description":"Job Role - React JS Developer\n\nJob Type - Contractual (Permanent WFH)\n\nImmediate Joining Required (Within 15 days)\n\nWe’re looking for an experienced individual who can work with us on new ambitious projects and enhance their skills. The selected developer would help us in developing new user-facing features using React, building reusable components and front-end libraries for future use and translating designs and wireframes into high-quality code. Further, it will be expected out of the developer to help in optimizing components for maximum performance a cross a vast array of web-capable devices and browsers.\n\nRequirements\n\nMust Have\n• 2+ years experience of building React applications\n• Strong Javascript fundamentals\n• Understanding of HTML/CSS concepts\n• Proven fluency with Hooks, Asynchronous programming and state management\n• Problem Solving aptitude, Responsive, Good communication\n• Architecture thinking and curiosity to write better code\n\nGood to have\n• Pro-active, Analytical... ability, Quick Learner, Focus on detail\n• Over-communication, Transparency\n• Experience with Multi-threading and background processing\n• Typescript, Redux Thunk, Service workers/workbox"},{"title":"React Native Developer","company":"6vertex Solutions","location":"via LinkedIn","description":"We are looking for a skilled React.js developer to join our front-end development team. In this role, you will be responsible for developing and implementing user interface components using React.js concepts and workflows such as Redux, Flux, and Webpack. You will also be responsible for profiling and improving front-end performance and documenting our front-end codebase.\n\nTo ensure success as a react.js developer, you should have in-depth knowledge of JavaScript React js, node js, and Mern stack concepts, excellent front-end coding skills, and a good understanding of progressive web applications. Ultimately, a top-class react.js developer should be able to design and build modern user interface components to enhance application performance.\n\nRoles and Responsibilities:\n• Responsible for development of new highly-responsive, web-based user interface\n• Construct visualizations that are able to depict vast amounts of data\n• Work and collaborate with the rest of the engineering team\n•... Work with product team and graphic designers\n• Learn and understand user interactions\n• Develop a flexible and well-structured front-end architecture, along with the APIs to support it\n\nRequired Qualifications:\n• Strong knowledge of the React framework and other JavaScript frameworks\n• Preferably experienced with HTML, CSS, Node.js and MERN stack\n• Knowledge of React and common tools used in the wider React ecosystem, such as Node.js and npm\n• Familiarity with common programming tools such as Redux, IDEs, RESTful APIs, Git repositories, TypeScript, version control software, and remote deployment tools\n• An understanding of common programming paradigms and fundamental React principles, such as React components, hooks, and the React lifecycle\n\nPreferred Qualifications:\n• At least 1 year of experience working as a frontend developer skilled with React or MERN stack.\n• Bachelor’s degree in computer science, software development, engineering, or a related field"},{"title":"React JS Developer","company":"Vertisystem","location":"Indore, Madhya Pradesh","description":"Greetings from TCS !!\n\nRole- React JS Developer\n\nLocation- PAN INDIA\n\nExperience- 3 to 9 years\n\nMust Have Skills:\n• Proven experience as a Front end Developer\n• Knowledge of multiple front-end languages and libraries (e.g. Angular, React, HTML/ CSS, JavaScript, XML, jQuery)\n• Great attention to detail\n• Organizational skills\n• An analytical mind\n• Degree in Computer Science, Statistics or relevant field\n• Build the front-end of applications through appealing visual design. Familiarity with common stacks\n• Knowledge of multiple back-end languages (e.g. C#, Java, Python) and JavaScript frameworks (e.g. Graphana.js)\n• Design client-side and server-side architecture\n• Troubleshoot, debug and upgrade software\n• Create security and data protection settings\n• Write technical documentation.\n• Work with data analysts to improve software\n\nIf Interested Please drop your cv to cidharth.t@tcs.com with the below details:\n\n· Name:\n\n· Contact No:\n\n· Email id:\n\n· Current Location:\n\n· Preferred... Location:\n\n· Highest Qualification (Part time / Correspondence are not Eligible) :\n\n· Total Experience:\n\n· Relevant Experience:\n\n· Notice Period:\n\n· Current CTC:\n\n· Expected CTC:\n\n· Gap in years if any (Education / Career):\n\n· EP Reference Number (if already registered with TCS) -\n\nRegards,\n\nCidharth.T\n\nTalent Acqusition\n\nTata Consultancy Services"},{"title":"React Native Developer","company":"Metafic","location":"via LinkedIn","description":"Job Description\n\nWe as a Company have extensive experience in building mobile (iOS/Android apps powered with AI/ML Models) and Web apps from scratch to scale, with highly trusted reviews from established global clients. Always Aiming at delivering your product with high-quality code and design. We have helped several start-ups and enterprises to build apps and reach millions of users.\n\nCase Studies: https://appmetry.com/case_studies.html\n\nReviews: https://clutch.co/profile/appmetry-technologies\n\nDesired Skills:\n\n● 4+ years extensive working experience in developing applications on React alone.\n\n● Experience working within consumer applications with a high amount of active users.\n\n● Strong foundation in computer science, data structures, algorithms and software design.\n\n● Building reusable components and front-end libraries for future use\n\n● Translating designs and wireframes into high quality code\n\n● Optimizing components for maximum performance across a vast array of web- capable... devices and browsers\n\n● Graduate in technical discipline (or equivalent working experience)\n\n● Strong understanding of UI concepts, techniques, frameworks and tools\n\n● Expertise in Redux/flux\n\n● Proficiency in HTML5 and CSS3\n\n● Strong expertise in javascript with Object Oriented JavaScript\n\n● Good communication Skills a must\n\n● Please attach links of your apps with the application.\n\nPosition\n\nFrontend Developers\n\nExpertise\n\nJavaScript React.Js Redux Flux HTML 5"},{"title":"React js Developer","company":"Dimiour","location":"Sagar, Madhya Pradesh","description":"Job Summary\n\nWe are looking for a great developer who is proficient with React.js. Your primary focus might vary from:\n\n(1) developing new user-facing features using React.js,\n\n(2) translating designs and wireframes into high-quality code,\n\n(3) building reusable components and front-end libraries for future use, and\n\n(4) optimizing components for maximum performance across a vast array of web-capable devices and browsers.\n\nA commitment to collaborative problem solving, sophisticated design, and quality product is essential.\n\nResponsibilities\n\n● You will be part of the entire process starting from conception to the major testing process and follow popular ReactJS workflows & Libraries.\n\n● Works with product team to understand project requirements\n\n● Knowledge and understanding of Backend technologies\n\n● Build reusable code and libraries for future use\n\n● Optimize applications for maximum speed and scalability\n\n● Leverage the inbuilt React toolkit for creating frontend features\n\n●... Create data visualization tools, libraries, and reusable code for prospects\n\n● Integrate designs and wireframes within the application code\n\n● Understanding and Knowledge of database, s/w development methodology and lifecycle.\n\n● Develop and execute unit tests.\n\n● Solve problems independently working with new technologies to create quick solutions.\n\n● You will work within a team, collaborate and add value through participation in peer code\n\n● Follow proper documentation for changes in application and further updates\n\n● Reviews, provide comments and suggestions, work with cross functional teams to achieve goals\n\n● Experience working with agile methodologies.\n\nSkills, Qualification & Experience\n\n● An engineering degree B.E/B.Tech/MCA/M.Tech/M.Sc\n\n● Minimum 6-7 years of total experience working as ReactJS developer\n\n● Familiarity with Blockchain\n\n● Minimum 2 years of experience with Next.js\n\n● Familiarity with newer specifications of EcmaScript\n\n● Experience with popular ReactJS workflows (such as Redux or MobX)\n\n● Strong proficiency in JavaScript, object model, DOM manipulation and event handlers, data structures, algorithms, JSX, and Babel\n\n● Complete understanding of ReactJS and its main fundamentals like JSX, Virtual DOM, component lifecycle, etc.\n\n● Knowledge of modern authorization mechanisms, such as JSON Web Token\n\n● Preceding experience with ReactJS workflows like Flux, Redux, Create React App, data structure libraries\n\n● Understanding of RESTful APIs/GraphQL, HTML/CSS, ES6 (variables and scoping, array methods), code versioning tools like GIT, etc., popular frontend development tools, CI/CD tools, Azure DevOps, performance testing frameworks like Mocha, Node + NPM\n\n● Knowledge of performance testing frameworks & Excellent troubleshooting skills\n\n● Strong analytical and problem-solving skills and an entrepreneurial mind-set.\n\nNotice\n\nImmediate or up to 15 days\n\nEmployment Type\n\nFull-time"},{"title":"Software Engineer(React Native Developer)","company":"Protonshub Technologies","location":"via Jobrapido.com","description":"Purpose:\n\nWe are looking for a great JavaScript developer who is proficient with React.js. Your primary focus will be on developing user interface components and implementing them following well-known React.js workflows (such as Flux or Redux). You will ensure that these components and the overall application are robust and easy to maintain. You will coordinate with the rest of the team working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and quality product is important. Your duties will include designing software solutions to meet project requirements, maintaining and refactoring existing code, writing tests, and fixing bugs.\n\nResponsibilities:\n\nHave good knowledge or experience on Axios and fetch\n\nDesign and develop new custom components to meet project requirements\n\nInstall and configure server environments for React deployments\n\nMaintain and update project dependencies as well as fix any... conflicts\n\nWorking with other JavaScript developers and software engineers to develop front-end and back-end architecture that’s well structured and flexible, along with the APIs to support it.\n\nSkills:\n\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\n\nThorough understanding of React.js and its core principles\n\nExperience with popular React.js workflows (such as Flux or Redux)\n\nFamiliarity with newer specifications of EcmaScript\n\nExperience with data structure libraries (e.g., Immutable.js)\n\nKnowledge of isomorphic React is a plus\n\nFamiliarity with RESTful APIs\n\nKnowledge of modern authorization mechanisms, such as JSON Web Token\n\nFamiliarity with modern front-end build pipelines and tools\n\nExperience with common front-end development tools such as Babel, Webpack, NPM, etc.\n\nAbility to understand business requirements and translate them into technical requirements\n\nA knack for benchmarking and optimization\n\nFamiliarity with code versioning tools {{such as Git, SVN, and Mercurial"},{"title":"Entry Level React.js Engineer","company":"CZ Consultants","location":"Indore, Madhya Pradesh"},{"title":"React JS Developer","company":"All About IT","location":"via LinkedIn"}]}